app/controllers/actions_controller.rb

  def index
    @actions = Action.all
---
SELECT "actions".* FROM "actions"