app/controllers/casts_controller.rb

  def index
    @casts = Cast.all
---
SELECT "casts".* FROM "casts"