app/controllers/fantasy_contestants_controller.rb

  def index
    @fantasy_contestants = FantasyContestant.all
---
SELECT "fantasy_contestants".* FROM "fantasy_contestants"