app/controllers/leagues_controller.rb

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @league = League.find(params[:id])

INSERT INTO "leagues" ("league_name", "password", "motto", "extra2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["league_name", "Test_league1"], ["password", "test"], ["motto", "We're testing here!"], ["extra2", ""], ["created_at", "2016-09-17 09:04:29.286860"], ["updated_at", "2016-09-17 09:04:29.286860"]]
---
  def create
    @league = League.new
    @league.league_name = params[:league_name]
    @league.password = params[:password]
    @league.motto = params[:motto]
    @league.league_locked_date = params[:league_locked_date]
    @userid = params[:user_id]
    if @league.save

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."league_name" = ? LIMIT 1  [["league_name", "Test_league1"]]
---
  def join
    @league = League.find_by(:league_name => params[:league_name])

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @league = League.find(params[:id])

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @league = League.find(params[:id])

SELECT "user_leagues".* FROM "user_leagues" WHERE "user_leagues"."league_id" = ?  [["league_id", 2]]
DELETE FROM "user_leagues" WHERE "user_leagues"."id" = ?  [["id", 3]]
---
  def destroy
    @league = League.find(params[:id])

    @league.destroy