app/controllers/user_leagues_controller.rb

SELECT "user_leagues".* FROM "user_leagues"
---
  def index
    @user_leagues = UserLeague.all

INSERT INTO "user_leagues" ("user_id", "league_id", "commissioner", "selected_contestants", "point_total", "points_last_week", "league_locked", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def newleague
    @user_league = UserLeague.new
    @user_league.user_id = params[:user_id]
    @user_league.league_id = params[:league_id]
    @user_league.commissioner = true
    @user_league.selected_contestants = false
    @user_league.point_total = 0
    @user_league.league_locked = false
    @user_league.points_last_week = 0

    if @user_league.save

INSERT INTO "user_leagues" ("user_id", "league_id", "commissioner", "selected_contestants", "point_total", "league_locked", "points_last_week", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def joinleague
    @user_league = UserLeague.new
    @user_league.user_id = params[:user_id]
    @user_league.league_id = params[:league_id]
    @user_league.commissioner = false
    @user_league.selected_contestants = false
    @user_league.point_total = 0
    @user_league.league_locked = false
    @user_league.points_last_week = 0

    if @user_league.save